// create table view data object
var data = [];
var logo = Ti.UI.createImageView({
    image:'rt_logo.png',
    top:0,
    width:139,
    height:66
});
Table = Ti.UI.createTableView();
function addrow(header,description) {
    var row = Ti.UI.createTableViewRow();
    row.height = "auto";
    row.header = header;
    row.className = "datarow";
    row.touchEnabled = false;  
    row.selectionStyle = Ti.UI.iPhone.TableViewCellSelectionStyle.NONE; 
    var caption = Ti.UI.createLabel({
        text:description,
        font:{fontSize:16},
        left:10,
        right:10,
        height:"auto"
    });	
    row.add(caption);
    data.push(row);
}

var rowlogo = Ti.UI.createTableViewRow();
rowlogo.height = "auto";
rowlogo.header = "Логотип подкаста «Радио-Т»";
rowlogo.className = "logorow";
rowlogo.touchEnabled = false;  
rowlogo.selectionStyle = Ti.UI.iPhone.TableViewCellSelectionStyle.NONE;
rowlogo.add(logo);
data.push(rowlogo);

radiot = "\t«Радио-Т» — еженедельное русскоязычное Hi-Tech шоу, публикуемое в виде подкаста и выходящее в прямой эфир по субботам в 23:00 по московскому времени.\n\tАудитория подкаста составляет примерно 25000 человек, из них почти 1000 слушают подкаст в прямом эфире.\n\tНа данный момент постоянными ведущими шоу являются Umputun из Напервилля (штат Иллинойс, США), Bobuk (Григорий Бакунов, зам. руководителя департамента разработки компании Яндекс) из Москвы, Gray (Сергей Петренко, генеральный директор украинского Яндекса) из Одессы и Marin_k_a из Киева.\n\tНе редки в подкасте и гости — так, в нем неоднократно принимали участия Эльдар Муртазин (главный аналитик Mobile Research Group) и Пётр Диденко (Platform Strategy Advisor в Microsoft Russia), выступали Степан Пачиков (со-основатель Evernote), Артём Росновский (ведущий Радио «Маяк»), Сергей Белоусов (основатель и руководитель компании Parallels) и другие.";
radiot_history = "\tПредпосылкой к созданию «Радио-Т» стал подкаст «Daily Geek Show», который попеременно вели около 5 человек, однако из-за творческой неудовлетворенности ведущих вскоре после 70-го выпуска он был закрыт.\n\tВ итоге 27 августа 2006 года в свет вышел пилотный, нулевой, выпуск подкаста «Т-Радио»; уже в следующем выпуске название было изменено на «Радио-Т».";
radiot_facts = " - Радио-Т считается самым популярным русскоязычным хай-тек подкастом.\n - Ведущие шоу одними из первых начали популяризировать в России такие сервисы как Twitter, Juick и другие.\n - Запись подкаста происходит через Skype.";
radiot_hrono = " - В 1 выпуске у подкаста появился первый вариант логотипа.\n - В 7 выпуске подкаст приобрел «Унцу» — закольцованную фоновую музыку (автор — Андрей Дементьев). Это стало своеобразной визитной карточкой Радио-Т.\n - В 17 выпуске появилась ещё один отличительный признак Радио-Т — классическое приветствие Умпутуна: «Доброго времени суток», которое было перенято у первого пришедшего в том выпуске гостя — подкастера Алекса.\n - В 34 выпуске впервые проведена онлайн-трансляция Радио-Т.\n - В мае 2007 года появился собственный веб-сайт. Позже был введён Jabber-чат.\n - В 46 выпуске появился современный вариант логотипа Радио-Т.\n - В 63 выпуске появился 3-й постоянный ведущий шоу — Olyapka (Ольга Шагалова), вещавшая из Перми. Первоначально её приход был неоднозначно воспринят слушателями, но в дальнейшем отношение изменилось в лучшую сторону.\n - В 82 выпуске было короткое и неформальное интервью с Алексом Могилевским из Microsoft.\n - Вскоре Olyapka переехала в Москву и, пропустив 4 выпуска шоу, по собственному желанию покинула подкаст как ведущая (хотя позже несколько раз посещала Радио-Т как гость). На её место пришёл Gray. Он впервые появился в 86 выпуске как специалист по поиску и оптимизации, а как постоянный третий ведущий закрепился в 90 выпуске шоу.\n - Несколько десятков выпусков в подкасте на правах постоянной ведущей участвовала Lavale.\n - В 145 выпуске в состав ведущих подкаста вошла Marin_k_a.\n - В 150 выпуске подкаст отметил трехгодичный юбилей.\n - В 173 выпуске Bobuk впервые вёл подкаст в видеорежиме. Во время вещания он был болен, поэтому вел его лежа в кровати.\n - 8 мая 2010 года в Киеве проводилась конференция \"РТ-Конь\", на которой присутствовали Bobuk, Gray, Lavale, Marin_k_a, Пётр Диденко и другие. Umputun участвовал с помощью Skype через видеосвязь.\n - В 187 выпуске в послешоу ведущие попытались сделать возможность смотреть подкаст в видеорежиме в реальном времени.\n";
addrow('Радио-Т', radiot);
addrow('История', radiot_history);
addrow('Хронология', radiot_hrono);
addrow('Интересные факты', radiot_facts);
Table.data = data;

Ti.UI.currentWindow.add(Table);
